app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function loginUser() {

        $validated = $this -> validate([
            'email'=>[
                'rules'=>'required|valid_email',
                'errors'=> [
                    'required'=> "Email is required",
                    'valid_email'=>"Email is already used"
                ]
            ],
            'password'=>[
                'rules'=>'required|min_length[5]|max_length[20]',
                'errors'=> [
                    'required'=> "Password is required",
                    'min_length'=>"Password must be at least 5 characters long",
                    'max_length'=>"Password must be at most 20 characters long"
                ]
            ]
        ]);

        if (! $validated) {
            return view('header')
            . view('login_page',['validation'=>$this->validator]);
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $userInfo = $userModel->where('email', $email)->first();