app/Controllers/CartController.php

SELECT *
FROM `product`
WHERE `product`.`ID` = '7'
---
    public function addItem($id) {
        $productModel = new ProductModel();
        $product = $productModel->find($id);