app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `users`.`ID` = '5'
---
    public function user_view()
    {
        $userModel = new UserModel();
        $userID = session()->get("loggedInUser");
        $data = [
            'user' => $userModel->find($userID) ,
        ];

SELECT `firstName`, `lastName`
FROM `users`
WHERE `ID` IS NULL
SELECT *
FROM `product`
---
    public function shop_view() {

        $productModel = new ProductModel();
        $userModel = new UserModel();

        $user = $userModel->select("firstName,lastName")->where("ID",session()->get("loggedInUser"))->find();
        $data = [
            'products' => $productModel->findAll(),
            'user' => $user
        ];